routes/web.php

select * from `commentaires`
select * from `categories`
select * from `ressources` where `categorie_id` = 2 and `id` != 1 limit 4
select * from `ressources` where `categorie_id` = 3 and `id` != 2 limit 4
select * from `commentaires` where `id` = 2 order by `created_at` desc
---
|
*/

View::composer('ressources.show', function($view){
  $currentRoute = Route::current();
  $id = $currentRoute->parameters()['id'];
  $ressource = App\Http\Models\Ressource::find($id);
  $commentaires = $ressource->commentaire;
  $view->with('commentaires', App\Http\Models\Commentaire::where('commentaire', $commentaires));
});


View::composer('categories.index', function( $view){
  $view->with('categories', App\Http\Models\Categorie::all());
});

View::composer('ressources.indexByCategorie', function( $view){
      $currentRoute = Route::current();
      $id = $currentRoute->parameters()['id'];
      $ressource = App\Http\Models\Ressource::find($id);
      $categorie_id = $ressource->categorie_id;
      $view->with('ressources', App\Http\Models\Ressource::where('categorie_id', $categorie_id)
                  ->where('id', '!=', $ressource->id)
                  ->limit(4)
                  ->get());
  });

/* View::composer('ressources.show', function( $view){
      $currentRoute = Route::current();
      $id = $currentRoute->parameters()['id'];
      $ressource = App\Http\Models\Ressource::find($id);
      $commentaires = $ressource->commentaire;
      $view->with('commentaires', App\Http\Models\Commentaire::where('commentaires', $commentaires));
  });