app/Http/Controllers/CommentaireController.php

insert into `commentaires` (`texte`, `user_id`, `ressource_id`, `updated_at`, `created_at`) values ('salut', '2', '2', '2019-06-12 11:43:41', '2019-06-12 11:43:41')
---
    public function addComment(Request $request)
    {

	        $commentaire = new Commentaire;
	        $commentaire->texte = $request->input('body');
	        $commentaire->ressource_id = $request->input('ressource');

	        $commentaire->save();